rocksdb/experiments/M2/results/20260429-052804-budget-sensitivity/bmin_6_ptarget_0p5/budget_on/run_1/db_bench.log
RocksDB:    version 8.11.3
Date:       Wed Apr 29 05:34:37 2026
CPU:        16 * Intel(R) Xeon(R) Gold 5320 CPU @ 2.20GHz
CPUCache:   16384 KB
Set seed to 1777440877869483 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       16 bytes each (+ 0 bytes user-defined timestamp)
Values:     1024 bytes each (512 bytes after compression)
Entries:    5000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    4959.1 MB (estimated)
FileSize:   2517.7 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
DB path: [rocksdbtest/dbbench]
fillrandom   :       6.244 micros/op 160148 ops/sec 31.221 seconds 5000000 operations;  158.8 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :       9.488 micros/op 105398 ops/sec 47.439 seconds 5000000 operations;  104.5 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :      11.269 micros/op 88741 ops/sec 56.343 seconds 5000000 operations;   88.0 MB/s


** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0     20/20   1.22 GB   0.0      0.0     0.0      0.0      14.6     14.6       0.0   1.0      0.0    500.9     29.84             22.07       240    0.124       0      0       0.0       0.0
  L1     21/21   1.22 GB   0.0     25.6    13.4     12.2      22.6     10.4       0.0   1.7    381.4    336.4     68.66             51.53        19    3.614     26M  3068K       0.0       0.0
  L2     93/0    4.46 GB   1.8     19.4     8.6     10.9      14.7      3.9       0.6   1.7    334.7    254.1     59.42             45.34       134    0.443     19M  4761K       0.0       0.0
 Sum    134/41   6.90 GB   0.0     45.0    21.9     23.1      51.9     28.8       0.6   3.6    291.7    336.5    157.92            118.94       393    0.402     45M  7830K       0.0       0.0
 Int      0/0    0.00 KB   0.0     44.7    21.7     23.1      51.2     28.2       0.6   3.6    292.9    335.3    156.45            117.74       385    0.406     45M  7825K       0.0       0.0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0     45.0    21.9     23.1      37.3     14.2       0.0   0.0    359.7    298.2    128.08             96.87       153    0.837     45M  7830K       0.0       0.0
High      0/0    0.00 KB   0.0      0.0     0.0      0.0      14.6     14.6       0.0   0.0      0.0    500.9     29.84             22.07       240    0.124       0      0       0.0       0.0

Blob file count: 0, total size: 0.0 GB, garbage size: 0.0 GB, space amp: 0.0

Uptime(secs): 135.0 total, 132.0 interval
Flush(GB): cumulative 14.597, interval 14.172
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 51.89 GB write, 393.59 MB/s write, 44.99 GB read, 341.24 MB/s read, 157.9 seconds
Interval compaction: 51.23 GB write, 397.40 MB/s write, 44.75 GB read, 347.13 MB/s read, 156.4 seconds
Write Stall (count): cf-l0-file-count-limit-delays-with-ongoing-compaction: 14, cf-l0-file-count-limit-stops-with-ongoing-compaction: 0, l0-file-count-limit-delays: 18, l0-file-count-limit-stops: 0, memtable-limit-delays: 0, memtable-limit-stops: 0, pending-compaction-bytes-delays: 0, pending-compaction-bytes-stops: 0, total-delays: 18, total-stops: 0
interval: 18 total count
Block cache LRUCache@0x55a90fea3df0#83920 capacity: 32.00 MB seed: 874674603 usage: 0.09 KB table_size: 1024 occupancy: 1 collections: 1 last_copies: 1 last_secs: 0.000184 secs_since: 135
Block cache entry stats(count,size,portion): Misc(1,0.00 KB,0%)

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 135.0 total, 132.0 interval
Cumulative writes: 15M writes, 15M keys, 15M commit groups, 1.0 writes per commit group, ingest: 14.75 GB, 111.89 MB/s
Cumulative WAL: 15M writes, 0 syncs, 15000000.00 writes per sync, written: 14.75 GB, 111.89 MB/s
Cumulative stall: 00:00:39.594 H:M:S, 29.3 percent
Interval writes: 14M writes, 14M keys, 14M commit groups, 1.0 writes per commit group, ingest: 14630.10 MB, 110.83 MB/s
Interval WAL: 14M writes, 0 syncs, 14527244.00 writes per sync, written: 14.29 GB, 110.83 MB/s
Interval stall: 00:00:39.594 H:M:S, 30.0 percent
Write Stall (count): write-buffer-manager-limit-stops: 0